#!/bin/bash
#-----------------------------------------------------------------------------
# kill_snmptoolkit.sh
#   SnmpToolkit強制終了スクリプト
#
# History:
#   2009/07/25 - 作成
#   2010/03/08 - Kernel2.6系でPIDを取得できるように修正
#-----------------------------------------------------------------------------

#-----------------------------------------------------------------------------
# スクリプトの配置ディレクトリを調べる
bindir=`dirname ${0}`
basedir=`cd ${bindir}; pwd`

#-----------------------------------------------------------------------------
# 環境定義ファイルを読み込む
source ${basedir}/setenv.sh

#-----------------------------------------------------------------------------
# 実行
pids=`ps -eo pid,args | grep snmptoolkit | grep D${TOOLKIT_NAME} | grep -v grep | awk '{print $1}'`
echo "snmptoolkit pids: ${pids}"
kill ${pids}
echo "kill snmptoolkit[${TOOLKIT_NAME}]."
