#!/bin/bash
#-----------------------------------------------------------------------------
# reloadmib.sh
#   AgentのMIBデータ再読み込みコマンド
#
# History:
#   2009/07/25 - 作成
#   2012/08/29 - パッケージ名変更
#-----------------------------------------------------------------------------

#-----------------------------------------------------------------------------
# スクリプトの配置ディレクトリを調べる
bindir=`dirname ${0}`
basedir=`cd ${bindir}; pwd`

#-----------------------------------------------------------------------------
# 環境定義ファイルを読み込む
source ${basedir}/setenv.sh

#-----------------------------------------------------------------------------
# 実行
#   ${1} - RMIレジストリURL
#   ${2} - AgentのIPアドレス (未指定の場合は全てのAgentが対象)
${JDK_BIN}/java                                                     \
  -cp ${TOOLKIT_LIB}                                                \
  jp.co.acroquest.tool.snmp.toolkit.command.ReloadMIBData            \
    $*
